onvif/test.xml

<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
    <SOAP-ENV:Header>
        <Security s:mustUnderstand="1"
            xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <UsernameToken>
                <Username>service</Username>
                <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">vRJnAFcBqIXFVKpMpHDAXGR1mos=</Password>
                <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">3JEHujmPwHJhhUKRcgG3Z1NWZMc=</Nonce>
                <Created
                    xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2019-02-11T21:11:52.000Z</Created>
            </UsernameToken>
        </Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tptz:SendAuxiliaryCommand>
        <tptz:ProfileToken>1</tptz:ProfileToken>
        <tptz:AuxiliaryData>Wiper|Off</tptz:AuxiliaryData>
        </tptz:SendAuxiliaryCommand>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
